package org.example.homework5.tsk6;

/**
 * 6. Очень сложное: Игра в слова
 * Задача:
 * Напишите игру, где:
 * Компьютер загадывает слово (храните слова в ArrayList<String>).
 * Игрок угадывает буквы.
 * Используйте HashSet<Character> для учета уже названных букв.
 * Логика:
 * Дается 10 попыток.
 * При неверной букве счетчик уменьшается.
 * При вводе некорректных данных (не буква или больше 1 символа) обрабатывайте возможные исключения что бы игра не прервалась и счетчик не уменьшился
 * Доп. задание:
 * Реализуйте подсказку: выводите буквы, которые еще не назывались.
 */
public class Tsk6 {
}
